# WallSweepType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..WallSweepType Property
WallSweepInfo Class See Also
---
The type (either a wall sweep or a reveal).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WallSweepType WallSweepType { get; set; }
```

Visual Basic
---
```text
Public Property WallSweepType As WallSweepType
	Get
	Set
```

Visual C++
---
```text
public:
property WallSweepType WallSweepType {
	WallSweepType get ();
	void set (WallSweepType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace